Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственныйОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/БизнесПриложениеПоискИПроверкаКонтрагентов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВключитьВозможностиПриложения() Экспорт
	
	ВозможностиПодключаемогоПриложения = ФункциональныеВозможностиПриложения();
	Отбор = Новый Структура("ЗначениеПоУмолчанию", Истина);
	ВозможностиПриложенияВключенныеПоУмолчанию = ВозможностиПодключаемогоПриложения.НайтиСтроки(Отбор);
	
	Для каждого ВозможностьПриложения Из ВозможностиПриложенияВключенныеПоУмолчанию Цикл
		
		Попытка
			ИмяКонстанты = ВозможностьПриложения.Имя;
			Константы[ИмяКонстанты].Установить(Истина);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьВозможностиПриложения(ИсключаяВозможностиПриложений) Экспорт
	
	ОтключаемыеВозможности = ФункциональныеВозможностиПриложения();
	
	Для Каждого ОтключаемаяВозможность Из ОтключаемыеВозможности Цикл
		
		Если ИсключаяВозможностиПриложений.Найти(ОтключаемаяВозможность.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ИмяКонстанты = ОтключаемаяВозможность.Имя;
			Константы[ИмяКонстанты].Установить(Ложь);
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = НСтр("ru='Ошибка попытки установки значения ""%1"" в константу ""%2"" по причине:
			|%3.'");
			Комментарий = СтрШаблон(Комментарий, Ложь, ИмяКонстанты, ТекстОшибки);
			ЗаписьЖурналаРегистрации(ТарификацияБизнес.ИмяЖР(), УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ВызватьИсключение;
	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриСозданииФормыСпискаКонтрагентов(ЭтотОбъект, Элементы) Экспорт
	
	Если НЕ ЭтотОбъект.ИспользоватьРаботуСПоискомКонтрагентовВСписке Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьКонтрагентыВСправочнике = ЕстьКонтрагентыВСправочнике();
	Элементы.Список.Видимость = ЕстьКонтрагентыВСправочнике;
	Элементы.ГруппаНетДанных.Видимость = НЕ ЕстьКонтрагентыВСправочнике;
	Элементы.ГруппаЗаголовокИПоискИПроверка.Видимость = Истина;
	ЭтотОбъект.Заголовок = НСтр("ru = 'Поиск и проверка контрагентов'");
	Элементы.КоманднаяПанель.Видимость = Ложь;
	Элементы.БыстрыйОтборИПоиск.Видимость = Ложь;
	Элементы.КоманднаяПанельУпрощенно.Видимость = Ложь;
	Элементы.ПоказыватьНедействительныхУпрощенныйИнтерфейс.Видимость = Ложь;
	Элементы.ПраваяПанельПоискИПроверкаКонтрагента.Видимость = Истина;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.ПраваяПанельПоискИПроверкаКонтрагента;
	Элементы.СписокКонтекстноеМенюГруппаЕще.Видимость = Ложь;
	Элементы.ЭДО.Видимость = Ложь;
	Элементы.Список.Шапка=Ложь;
	Элементы.СписокКонтекстноеМенюГруппаПоискИПроверка.Видимость = Истина;
	Элементы.СписокКонтекстноеМенюГруппаКоманд.Видимость = Ложь;

КонецПроцедуры

Функция ПоискИПроверкаАвтоподбор(Параметры, ОкончаниеВводаТекста) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбораКонтрагенты = Справочники.Контрагенты.ПолучитьДанныеВыбора(Параметры);
	МассивЗначенийКонтрагенты = Новый Массив;
	Для Каждого Контрагент Из ДанныеВыбораКонтрагенты Цикл
		Если ТипЗнч(Контрагент.Значение) = Тип("Структура") Тогда
			МассивЗначенийКонтрагенты.Добавить(Контрагент.Значение.Значение);
		Иначе
			МассивЗначенийКонтрагенты.Добавить(Контрагент.Значение);
		КонецЕсли;
	КонецЦикла;

	Если МассивЗначенийКонтрагенты.Количество() <> 0 Тогда
		ВидыКонтрагентов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЗначенийКонтрагенты, "ВидКонтрагента");
		Для Каждого Контрагент Из ДанныеВыбораКонтрагенты Цикл
			ДанныеВыбора.Добавить(Контрагент.Значение, Контрагент.Представление, ,КартинкаПоВидуКонтрагента(ВидыКонтрагентов[Контрагент.Значение]));
		КонецЦикла;
	КонецЕсли;
	
	ЮрЛица = РаботаСКонтрагентами.ЮридическиеЛицаПоНаименованию(Параметры.СтрокаПоиска);
	Если ЮрЛица.ОжиданиеОтвета Тогда
		ЮрЛица = РаботаСКонтрагентами.ЮридическиеЛицаПоНаименованию(Параметры.СтрокаПоиска);
	КонецЕсли;
	
	НайденныеОрганизации = ЮрЛица.РеквизитыОрганизаций;
	
	Для Каждого Организация Из НайденныеОрганизации Цикл
		ДанныеВыбора.Добавить(Организация.ИНН, СтрШаблон("%1, ИНН: %2", Организация.Наименование, Организация.ИНН));
	КонецЦикла;

	СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
	ДлинаСтроки  = СтрДлина(Параметры.СтрокаПоиска);
	ЭтоСтрокаИНН = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(Параметры.СтрокаПоиска));
	
	Если ЭтоСтрокаИНН Тогда
		
		МассивПодстрок   = Новый Массив;
		МассивПодстрок.Добавить(НСтр("ru='Проверить: ИНН '"));
		ИНН = Лев(СтрокаПоиска, 12);
		ЭтоКорректныйИНН = (ДлинаСтроки = 10
		И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Истина, ""))
		ИЛИ (ДлинаСтроки = 12
		И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Ложь, ""));
		Если ЭтоКорректныйИНН Тогда
			ПолужирныйШрифт = Новый Шрифт(, , Истина);
			МассивПодстрок.Добавить(
			Новый ФорматированнаяСтрока(ИНН, ПолужирныйШрифт, ЦветаСтиля.РезультатУспехЦвет));
		Иначе
			МассивПодстрок.Добавить(ИНН);
		КонецЕсли;
		СколькоВопросов = ?(ЭтоКорректныйИНН ИЛИ ДлинаСтроки >= 12, 0, 
		?(ДлинаСтроки < 10, 10 - ДлинаСтроки, 12 - ДлинаСтроки));
		ЗнакиВопроса = Лев("????????????", СколькоВопросов);
		ЛишниеЦифры  = Сред(СтрокаПоиска, 13);
		МассивПодстрок.Добавить(
		Новый ФорматированнаяСтрока(ЗнакиВопроса + ЛишниеЦифры, , ЦветаСтиля.ЦветТекстаНекорректногоКонтрагента));
		МассивПодстрок.Добавить(Символы.НПП);
		Если НЕ ЭтоКорректныйИНН Тогда
			МассивПодстрок.Добавить(НСтр("ru='(укажите ИНН полностью)'"));
		КонецЕсли;
		ПредставлениеНового = Новый ФорматированнаяСтрока(МассивПодстрок);
		ДанныеВыбора.Добавить(СтрокаПоиска, ПредставлениеНового);
		
	КонецЕсли;
			
	Возврат ДанныеВыбора;
	
КонецФункции

Функция НовыйКонтрагентПоДаннымПроверки(ТекстЗаполнения) Экспорт
	
	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Заполнить(Неопределено);
	ЗаполнитьРеквизитыПоТекстуЗаполнения(ТекстЗаполнения, НовыйКонтрагент);
	НовыйКонтрагент.Покупатель = Истина;
	НовыйКонтрагент.Записать();
	Возврат НовыйКонтрагент.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КартинкаПоВидуКонтрагента(ВидКонтрагента)
	
	Если ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель
				ИЛИ ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо Тогда
		Возврат БиблиотекаКартинок.КоллекцияКонтрагентыФизическоеЛицо;
	Иначе
		Возврат БиблиотекаКартинок.КоллекцияКонтрагентыКомпания;
	КонецЕсли;
	
КонецФункции

Функция ЕстьКонтрагентыВСправочнике()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Покупатель = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ФункциональныеВозможностиПриложения() Экспорт
	
	ТаблицаВозможностей = ТарификацияБизнес.НоваяТаблицаВозможностей();
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ИспользоватьРаботуСПоискомКонтрагентовВСписке", Истина);
	ТарификацияБизнес.ДобавитьВозможностьВПриложение(ТаблицаВозможностей, "ОтображатьПереходКУдалениюОбъектовГлавное", Истина);
	
	Возврат ТаблицаВозможностей;
	
КонецФункции

Процедура ЗаполнитьРеквизитыПоТекстуЗаполнения(Знач ТекстЗаполнения, Контрагент)
	
	Если (СтрДлина(ТекстЗаполнения) = 10 ИЛИ СтрДлина(ТекстЗаполнения) = 12)
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекстЗаполнения) Тогда
		
		Контрагент.Наименование = "";
		Контрагент.ИНН = ТекстЗаполнения;
		Контрагент.ВидКонтрагента = ?(СтрДлина(ТекстЗаполнения) = 10,
			Перечисления.ВидыКонтрагентов.ЮридическоеЛицо,
			Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель);
		ТекстЗаполнения = Неопределено;
		
		ОписаниеОшибкиЗаполнения = "";
		ЗаполнитьРеквизитыПоИНННаСервере(Контрагент.ИНН, Контрагент);
		
	Иначе
		
		Контрагент.НаименованиеПолное = ТекстЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоИНННаСервере(ИНН, Контрагент)
	
	Если СтрДлина(ИНН) = 12 Тогда
		ЭтоЮрЛицо = Ложь;
	Иначе
		ЭтоЮрЛицо = Истина;
	КонецЕсли;
	
	ЭтоГосударственныйОрган = Ложь;
	КодОКВЭД = "";
	
	Если ЭтоЮрЛицо Тогда
		РеквизитыКонтрагента = РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН(ИНН);
		
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
			ОписаниеОшибкиЗаполнения = РеквизитыКонтрагента.ОписаниеОшибки;
			Возврат;
		КонецЕсли;
		
		Если РеквизитыКонтрагента.ЕГРЮЛ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Контрагент.Наименование         = РеквизитыКонтрагента.ЕГРЮЛ.Наименование;
		Контрагент.НаименованиеПолное   = РеквизитыКонтрагента.ЕГРЮЛ.НаименованиеСокращенное;
		Контрагент.ИНН                  = РеквизитыКонтрагента.ИНН;
		Контрагент.КПП                  = РеквизитыКонтрагента.ЕГРЮЛ.КПП;
		Контрагент.РегистрационныйНомер = РеквизитыКонтрагента.ЕГРЮЛ.РегистрационныйНомер;
		РеквизитыКонтрагента.ЕГРЮЛ.Свойство("КодОКВЭД", КодОКВЭД);
		
		ЗаполнитьКонтактнуюИнформациюКонтрагентаПоДаннымЕГРЮЛ(РеквизитыКонтрагента, Контрагент);
		
		Руководители = РеквизитыКонтрагента.ЕГРЮЛ.ДанныеРуководителей.Руководители;
		НаименованиеПолное = РеквизитыКонтрагента.ЕГРЮЛ.НаименованиеПолное;
		
	Иначе
		
		РеквизитыПредпринимателя = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(ИНН);
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.ОписаниеОшибки) Тогда
			ОписаниеОшибкиЗаполнения = РеквизитыПредпринимателя.ОписаниеОшибки;
			Возврат;
		КонецЕсли;
		
		Контрагент.Наименование			= РеквизитыПредпринимателя.Наименование;
		Контрагент.НаименованиеПолное	= РеквизитыПредпринимателя.НаименованиеСокращенное;
		Контрагент.ИНН					= РеквизитыПредпринимателя.ИНН;
		Контрагент.РегистрационныйНомер	= РеквизитыПредпринимателя.РегистрационныйНомер;
		РеквизитыПредпринимателя.Свойство("КодОКВЭД", КодОКВЭД);
		
		Если РеквизитыПредпринимателя.СвидетельствоОРегистрации <> Неопределено Тогда
			Контрагент.СвидетельствоСерияНомер = "" + РеквизитыПредпринимателя.СвидетельствоОРегистрации.Серия + " " + РеквизитыПредпринимателя.СвидетельствоОРегистрации.Номер;
			Контрагент.СвидетельствоДатаВыдачи = РеквизитыПредпринимателя.СвидетельствоОРегистрации.Дата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.Фамилия) Тогда
			Контрагент.ФИО = РеквизитыПредпринимателя.Фамилия
				+ ?(ПустаяСтрока(РеквизитыПредпринимателя.Имя), "", " " + РеквизитыПредпринимателя.Имя)
				+ ?(ПустаяСтрока(РеквизитыПредпринимателя.Отчество), "", " " + РеквизитыПредпринимателя.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыПредпринимателя.Пол) Тогда
			Контрагент.Пол = ?(РеквизитыПредпринимателя.Пол = "1", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский);
		КонецЕсли;
		
		НаименованиеПолное = РеквизитыПредпринимателя.НаименованиеПолное;
		
	КонецЕсли;
		
	Если СтрНачинаетсяС(КодОКВЭД, "84.") Тогда
		ЭтоГосударственныйОрган = Истина;
	КонецЕсли;

	Если ЭтоГосударственныйОрган Тогда
		Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
	ИначеЕсли СтрДлина(ИНН) = 10 Тогда
		Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	КонецЕсли;
				
КонецПроцедуры

Процедура ЗаполнитьКонтактнуюИнформациюКонтрагентаПоДаннымЕГРЮЛ(СведенияОЮридическомЛицеПоИНН, Контрагент)
	
	НоваяКонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	
	Если СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.ЮридическийАдрес.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	КонецЕсли;
	
	Если СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Свойство("Телефон")
		И СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон <> Неопределено Тогда
		ДанныеКИ = НоваяКонтактнаяИнформация.Добавить();
		ДанныеКИ.Представление = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон.Представление;
		ДанныеКИ.Значение = СведенияОЮридическомЛицеПоИНН.ЕГРЮЛ.Телефон.КонтактнаяИнформация;
		ДанныеКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(Контрагент, НоваяКонтактнаяИнформация);
	
КонецПроцедуры

#КонецОбласти
